Revit 2027 API
FabricationConfiguration.GetAllPartCustomData Method
 Gets all possible fabrication part custom data identifiers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<int> GetAllPartCustomData()
Public Function GetAllPartCustomData As IList(Of Integer)
public:
IList<int>^ GetAllPartCustomData()
member GetAllPartCustomData : unit -> IList<int>
Return Value
IList<Int32>
 An array of custom data identifiers.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace